import { Component, OnInit } from '@angular/core';

import { TermSectionData } from './term-section-data';

@Component({
  selector: 'my-terms-page',
  templateUrl: './terms-page.component.html',
  styleUrls:['./terms-page.component.scss']
})
export class TermsPageComponent implements OnInit {

    terms:TermSectionData[] = [ new TermSectionData("רכישה באתר",
    ["ניתן לרכוש מוצרים באתר לבעלי כרטיסי אשראי בלבד. התמונות המופיעות באתר הן להמחשה בלבד. לאחר בחירת המוצר אותו אתם מבקשים לרכוש, יש להוסיפו לסל הקניות . לאחר שבחרתם את המוצרים אותם אתם מבקשים לאשר את ההזמנה. אישור ההזמנה מהווה אישור על הסכמתכם לתנאי האתר ותנאי הרכישה באתר."]),
                              new TermSectionData("הזכות להשתתף במכירות הנערכות",
                              ["רשאי להשתתף במכירות המבוצעות באתר כל אדם שהוא תושב ישראל, מעל גיל 18, שבבעלותו כרטיס אשראי ישראלי (מקומי ו/או בינלאומי) תקף, בקניה קמעונאית בלבד. ההשתתפות מותנית בהרשמה לאתר ומסירת פרטים אישיים מלאים, נכונים ומדויקים, הכוללים שם, מס' זהות, כתובת, מספר טלפון וכתובת דואר אלקטרוני תקינה.",
                              "במידה והמזמין קטין (מתחת לגיל 18) או אינו זכאי לבצע פעולות משפטיות ללא אישור אפוטרופוס, יראו את שימושו באתר כאילו קיבל אישור האפוטרופוס.",
                              "תנאי מוקדם לאישור עסקת הרכישה הוא אישורה על ידי חברת כרטיסי האשראי. המוצר יסופק לבית המזמין רק לאחר קבלת אישור זה ובהתאם ליתר הוראות התקנון.",
                              "לב התחביב שומרת לעצמה את הזכות הבלעדית, בכל עת, וזאת על פי שיקול דעתה הבלעדי להפסיק ו/או למנוע באופן מיידי את הגישה למכירות ו/או לבטל השתתפות של משתמשים, שהתנהגותם אינה הולמת או שאינה לפי כללי ההשתתפות, ו/או המנסים לפגוע בניהולן התקין של המכירות באתר ו/או שהפרו את אמנת הפרטיות ו/או כל דין, חוק, תקנה ו/או הוראה אחרת ו/או באם תחליט לב התחביב כי המשתמש בצע שימוש בלתי ראוי או בלתי סביר באתר."]),
                              new TermSectionData("שמירה על סודיות הנתונים ופרטיות הלקוח",
                              ["הפרטיות שלך חשובה לנו. כדי לשפר את ההגנה על הפרטיות שלך אנחנו מספקים מידע זה לגבי מדיניות הגנת הפרטיות שלנו ואודות האפשרויות העומדות בפניך בעת השהות באתר וככל הנוגע להתנהלות שלנו לגבי איסוף מידע באתר.",
                              "בטופס ההזמנה הנך נדרש למסור פרטים אישיים (כגון: שם, ת.ז., כתובת דוא\"ל וטלפון). מסירת הפרטים האישיים בטופס ההזמנה נעשית עפ\"י רצונו של המזמין ובהסכמתו. מילוי הפרטים מעיד על הסכמתו של המזמין למסירתם.",
                              "מטרת מסירת הפרטים האישיים היא לאפשר לחברה לספק את המוצרים ו/או השירותים למזמין. כמוכן נדרשים פרטי כרטיסי האשראי של המזמין על מנת להשלים את העסקה המידע אינו מועבר לכל גורם אחר למעט ככל הנדרש להשלמת העסקה (כגון לחברת האשראי). במקרה ששלחת לנו דוא\"ל נשתמש בכתובת הדוא\"ל שממנה שלחת לצורך משלוח דוא\"ל חוזר אך לא לכל מטרה אחרת וכמו כן לא נמסור את הכתובת לכל גוף אחר.",
                              "אנו עושים שימוש במידע לא מזהה, כלומר מידע שלא יזהה את המשתמש אישית ולא יכלול מידע רגיש כהגדרתו בחוק הגנת הפרטיות לצורך שיפור השירותים המוענקים על ידינו, ליצירת הקשר עם המזמין או לצורך ניתוח ומסירת מידע סטטיסטים לצדדים שלישיים, לרבות מפרסמים.",
                              "לב התחביב נוקטת אמצעי זהירות מקובלים על מנת לשמור, ככל האפשר, על סודיות המידע, כל העברה של מספר כרטיס אשראי מהאתר נעשית באופן מוצפן לפי תקן אך בקיום מקרים שאינם בשליטתה ו/או הנובעים מכוח עליון,לא תהיה מאי ארט אחראית לכל נזק מכל סוג שהוא, ישיר ו/או עקיף, שיגרם למזמין ו/או למי מטעמו אם מידע זה יאבד או אם יעשה בו שימוש לא מורשה.",
                              "באתר ניתן למצוא קישוריות ו/או הפניות המקשרים אל מקורות מידע או משאבים אחרים המצויים על אתרים אחרים במרחבי האינטרנט, שאינם החברה. אם לא נאמר אחרת ובאופן מפורש על ידי החברה, הרי שהקישוריות הללו אל האתרים האחרים, אפילו אם ישנו לוגו (או סימן אחר)משותף של לב החביב ושל הצד השלישי, אינן יכולות להתפרש כהבעת תמיכה או מתן חסות,במפורש או מכללא, על ידי לב התחביב לגבי האתרים האחרים שאליהם מובילות הקישוריות האמורות. קישורית לאתר שאינו החברה, אינה מעידה על כך כי החברה, אחראית ו/או שולטת ו/או מיודעת על התכנים באתר הצד השלישי, ולב התחביב לא תשא באחריות כלשהי לגבי תכנים אלה. לכן אמנת הפרטיות של האתר אינה חלה ו/או אינה תקפה באתרים שאליהם מובילות הקישוריות."]),
                              new TermSectionData("המוצרים באתר",
                              [" התחביב מציעה לרכישה באתר מוצרים בדגמים שונים, סוגים וכמויות כפי שתמצא לנכון, ולפי שיקול דעתה הבלעדי. לב התחביב שומרת לעצמה את הזכות הבלעדית, ובכל עת, להוסיף ו/או לגרוע מוצרים ו/או שירותים המוצעים לרכישה באתר וכן לקבוע את אופן הרכישה ואת מחיר הרכישה.",
                              "המוצרים המשתתפים באתר זה ומחיריהם יהיו בתוקף לגבי המלאי הקיים בלבד.",
                              " התחביב שומרת לעצמה את הזכות, לפי שיקול דעתה הבלעדי, שלא לספק מוצר מסוים, במידה והמוצר אזל במלאי החברה. לב התחביב תודיע למזמין על מוצר שאינו במלאי תוך 4 ימי עסקים. במקרה כזה תודיע לב התחביב ללקוח על ביטול העסקה, או לחילופין, תציע לו מוצר חלופי.",
                              "התצלום המופיע במודעת המוצר מיועד להמחשה בלבד. המפרט המלא של המוצר עשוי שלא להשתקף במלואו בתצלום המופיע במודעת המוצר. במקרה של פער או הבדל יגברו המילים הכתובות במודעת המוצר על התיאור הנשקף מהתצלום.",
                              "בכל מקרה שבו, מחמת טעות שבתום לב, הפרטים המתוארים במודעת המוצר אינם תואמים את המוצר שלשם מכירתו פורסמה מודעת המוצר, תינתן אפשרות למזמין לבחור בין קבלת המוצר הקיים כפי שניתן לספקו בפועל, לבין קבלת כל הסכומים שנגבו ממנו על חשבון המוצר, וזו תהא תרופתו היחידה.",
                              "בכל מודעת מוצר באתר מופיעים המפרט הטכני ותיאור המוצר ו/או השירות, כפי שנמסרו על ידי המשווקים. משווקי המוצרים והשירותים נוטלים על עצמם את כל החובות המוטלות על \"עוסק\" על פי כל דין ובפרט על פי החוקים והתקנות להגנת הצרכן, לגבי המוצרים והשירותים המוצעים על ידם באתר, ובהתאם לתנאי תעודות האחריות והשירות הצמודות לכל מוצר ושירות."]),
                              new TermSectionData("המכירה",
                              ["במסגרת ביצוע פעולת הרכישה באתר במכירה רגילה ו/או מכירת חיסול יהיה על מבצע הפעולה למלא טופס הזמנה, תוך הזנת מלוא הפרטים הנדרשים. מסירת הפרטים הינה תנאי להשתתפות ברכישת המוצרים המוצעים למכירה באתר. אולם אינה מחויבת על פי חוק.",
                              "מכירה קבוצתית: מכירה בה מוצע לקבוצת משתתפים אחת מוצר במחיר אחיד, וזאת בתנאי שהקבוצה תכלול מספר מינימאלי של קונים המעוניינים לרוכשו והכול כפי שיצוין בהודעת המוצר. ההצעה לרכישת המוצר תהיה בתוקף לזמן מוגדר, החל מהמועד המצוין במודעת המוצר ותסתיים במועד הסגירה הנקוב, או לפניו – במקרה בו התקבלו הזמנות לכל הכמות המוצעת.",
                              "מכירת חיסול:  מכירה בה מוצע למכירה מלאי קיים של מוצרים שהוא אחרון מסוגו.",
                              "היה ובמועד הסגירה הנקוב במכירה קבוצתית לא כללה הקבוצה את המספר המינימאלי של קונים, תהא לב התחביב, רשאית לבטל את המכירה והקונים לא יחויבו בתשלום.",
                              "על אף האמור לעיל, תהא לב התחביב רשאית, אך לא חייבת, להאריך את מועד הסגירה הנקוב, על מנת לאפשר לקונים נוספים להשתתף במכירה הקבוצתית. לחילופין תהא לב התחביב רשאית למכור את המוצר לקונים אשר השתתפו במכירה קבוצתית, וזאת על אף העובדה שבמועד הסגירה הנקוב לא כללה הקבוצה מספר מינימאלי של קונים.",
                              "במכירה רגילה ו/או במכירת חיסול ו/או במכירה קבוצתית תשתכלל עסקת הקנייה רק לאחר שלב התחביב תקבל אישור מאת חברת כרטיסי האשראי על ביצוע החיוב, בהתאם לנוהלי העבודה הקיימים בינה לבין לב התחביב.",
                              "מובהר בזאת כי מבצעים המתקיימים בחנויות לב התחביב אינם חלים באתר זה.אין כפל מבצעים."]),
                              new TermSectionData("ביטול רכישה",
                              ["על ידי המזמין:",
                              "הלקוח מחויב לבדוק את המוצר מייד עם קבלתו. במידה שהמוצר סופק כאשר הוא פגום או כאשר מפרט המוצר שונה מהמפרט שפורסם באתר, רשאי הלקוח לבטל תוך מתן הודעה למוקד השירות ובמקרה כזה לא יחויב הלקוח בגין דמי ביטול.",
                              "בכל מקרה אחר רשאי הלקוח לבטל את העסקה וזאת תוך 14 יום מיום קבלת המוצר,או מיום קבלת מסמך פרטי העסקה, לפי המאוחר,תוך חיוב הלקוח בדמי ביטול בשיעור של 5% ממחירו הכולל של המוצר או בסך 100 ₪, הנמוך מבין השניים.",
                              "הלקוח מחויב להחזיר את המוצר ללב התחביב ולמען הסר ספק , עלות הוצאות המשלוח למשרדינו יחולו על הרוכש.",
                              "על אף האמור לעיל לא ניתן לבטל את רכישת המוצרים הבאים:",
                              "1.מוצרים במבצע.",
                              "2.מוצרים הניתנים להקלטה, לשעתוק, או לשכפול, שהמזמין פתח את אריזתם המקורית.",
                              "יודגש כי לא יהא בכל האמור לעיל בכדי לגרוע מזכותה של לב התחביב לתבוע כל נזק שייגרם לה בגין ביטול כאמור בשל העובדה שערך המוצר פחת כתוצאה מהרעה משמעותית במצבו.",
                              "3. ביטול עיסקה יעשה בכתב באמצעות הפקס.",
                              "על ידי החברה:",
                              "בכל אחד מהמקרים המפורטים להלן תהיה לב התחביב והאתר רשאים לבטל את ההזמנה ו/או ההתקשרות עם המזמין, ובלבד שתשלח הודעה בכתב למזמין על ביטול ההזמנה ו/או ההתקשרות,תוך פירוט נימוקי הביטול בתוך 10 ימי עבודה ממועד אישור ההזמנה:",
                              "1.במקרה שבו תיפול טעות בתום לב באחד מן הנתונים המפורטים במודעת המוצר על בסיסה נערכה ההזמנה.",
                              "2.במקרה של העלאה בשיעור המיסים, אגרות, היטלים וכל תשלומי החובה החלים על המוצרים שהוצעו באתר, ואשר נכנסה לתוקפה כדין בתקופה שממועד אישור ההזמנה ועד למועד אספקת המוצר.",
                              " 3.במקרה שבו ימנע \"כוח עליון\" את פעילותו התקינה של האתר. \"כוח עליון\",לרבות אך לא רק, מקרה של תקלה מהותית במערכת המחשב, במערכת הטלפונים או במערכות תקשורת אחרות המשרתות את לב התחביב ו/או האתר, במקרה של אירוע ביטחוני חריג, אירוע טרור (חו\"ח), ובכל מקרה אחר בו יעכבו, ימנעו או ישבשו גורמים ו/או אירועים שאינם בשליטת מאי ארט ו/או האתר את פעילותו התקינה של האתר או את הספקת המוצרים.",
                              "4.במקרה בו לא עמד המזמין בהתחייבות מהתחייבויותיו על פי הסכם הרכישה לרבות אך לא רק, ההתחייבות לתשלום התמורה בגין המוצר שהזמין, ו/או בכל מקרה בו מסר המזמין פרטים לא נכונים ו/או לא מדויקים ו/או לא מושלמים.",
                              "ויודגש כי הגשת פרטים כוזבים הנה עבירה פלילית והעושה כן, צפוי להליכים משפטיים פליליים ואזרחיים",
                              "5.אם התברר שהתבצעה ו/או מתבצעת באתר פעילות לא חוקית."]),
                              new TermSectionData("משלוח ומועדי אספקת המוצר",
                              ["אספקת המוצר, כפי שיפורט במודעת המוצר, תהא בימי עבודה הנספרים (ימים א\"-ה\" בשבוע, לא כולל ימי שבתון, ערבי חג וחגים) מיום קבלת אישור לעסקה מחברת כרטיסי האשראי של המזמין.",
                              "לב התחביב לא תהא אחראית בגין עיכובים שאינם בשליטתה ו/או שמקורם במזמין, לרבות אך לא רק עיכוב בגין קושי ליצור קשר עם המזמין בשעות העבודה המקובלות, עיכוב כאמור לא ייחשב כהפרת התחייבות של לב התחביב לאספקת המוצר.",
                              "בהודעת המוצר מוצג מחיר המוצר, מתחתיו דמי משלוח ולבסוף המחיר הכולל.",
                              "עקב המצב הביטחוני השורר במדינה, מסרבות חברות ההובלה להוביל מוצרים ליישובים מסוימים שהכניסה אליהם כרוכה בסכנת חיים למוביל. במקרה כזה תהא חברת ההובלה רשאית לתאם עם הלקוח את מסירת המוצר במקום מוסכם אחר שיהיה מקובל על הצדדים.",
                              "חתימת הלקוח על תעודת המשלוח מהווה אישור הלקוח להזמנה שביצע ולחיובו באמצעות כרטיס האשראי. אספקת המוצרים ללקוח תעשה ע\"י אביב שיגור או באמצעות הספק, לפי קביעת לב התחביב. הלקוח רשאי לאסוף את המוצר מהחנות לב התחביב ברחוב המנוף 6 רחובות ובמקרה כזה, לא יחויב הלקוח בדמי המשלוח. על הלקוח לציין כי הוא מעוניין לאסוף את המוצר באופן עצמאי במקום המיועד לכך על גבי ההזמנה. "]),
                              new TermSectionData("אחריות בגין המוצר",
                              ["מפרט המוצר נמסר מהיבואן ובאחריותו.",
                              "מבלי לפגוע בכלליות האמור לעיל, מובהר בזאת כי, לב התחביב תהא פטורה בכל אחריות לכל נזק שיגרם, במישרין ו/או בעקיפין בקשר עם מוצר, לרבות אך לא רק מחמת איכותו, טיבו, והשימוש בו, אלא אם כן לב התחביב הינה הספק של המוצר.",
                              "יחד עם זאת, במקרים בהם תתקבלנה תלונות צרכנים, תנקוט החברה בכל האמצעים מול הספקים בכד לפתור תלונות אלו."])
                              ];

  constructor() { }

  ngOnInit() {
     window.scrollTo(0,0);
 }

}
